[
  {
    "id": "y4qk7m",
    "title": "Data Driven Transformation of Global Pro Services Co",
    "categories": [
      "Data & Business Analytics",
      "Big Data & Analytics",
      "Data Science & Analysis"
    ],
    "description": "A global leader in technology talent services is undergoing a transformation in which it needs to transform its data infrastructure, systems, and operations to be more strategically aligned to customers. Think of the shift from being a reactive vendor who services talent needs to a proactive market-maker who seeks out its most strategic partners. \n\nThey are seeking an experienced data strategist and architect to support a ~3 month engagement focused on data discovery across ~100K job requisitions and 1 million+ talent profiles and helping to devise a \"talent exchange\" that provides dynamic data for leaders to steer the business. \n\n\nConduct data discovery and cleaning to classify both talent and demand at scale.\nHelp design and validate a standardized scoring rubric to evaluate opportunities based on multiple factors.\nDefine a common data language that enables clearer understanding of workforce supply/demand dynamics.\nSupport the development of a data-driven recommendation engine that pulls live information (e.g., via Salesforce CRM).\nConfirm and refine the current draft architecture (already ~85% complete) and advise on polishing it into a scalable, always-on system.\n\nData Discovery & Cleaning: Assess existing job and talent data, identify leakage, and prepare it for AI-driven classification.\nArchitecture & Rules Development: Build frameworks to classify demand and talent, set scoring rules, and define data inputs/outputs.\nRecommendation Engine Validation: Vet the design of the recommendation system, including its data architecture and specificity requirements.\n\nDeep experience ins.\nSkilled at identifying relationships between complex datasets \nStrong familiarity with BI and visualization tools (Looker preferred; Tableau/Power BI also relevant).\nComfortable with Salesforce data integrations.\nBackground in consulting or advanced data strategy roles preferred (prior MBB experience preferred, though not required).\nAdvanced beyond spreadsheet-level analysis; has handled large-scale, high-complexity datasets.\n\nStart date: ASAP\nDuration: Approx. 3 months (potential for extension).\nStructure: Deliverable-based / fixed cost (not hourly)\nRemote role",
    "location": "$80,000",
    "time_posted": "19 minutes",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "rdnvw6",
    "title": "Strategic IT Integration Lead: Global vs. Regional Operating Model (International Sportswear Retail)",
    "categories": [
      "Corporate Strategy",
      "Mergers & Acquisitions",
      "Post-Merger Integration"
    ],
    "description": "Project Overview:\nWe are seeking an expert IT M&A Strategy Consultant to lead the development of a technology integration framework following a high-profile, of a major US-based athletic footwear and fashion retailer by a leading .\nThe goal of this engagement is to define a clear . You will determine which parts of the technology stack should be centralized under the global parent’s infrastructure (e.g., Global Order Management, ERP) and which should remain regional or entity-specific to maintain the US brand's \"best-in-class\" local performance. You will serve as a strategic advisor to the , providing the framework and \"hand-holding\" necessary to navigate this transatlantic integration.\n\n\nDevelop the decision-making matrix to categorize IT services and systems into Global, Regional, or Local \"buckets.\"\nEvaluate the newly acquired US entity’s \"best-in-class\" e-commerce and omnichannel platforms against the global parent’s existing ecosystem to identify synergies, redundancies, or retention needs.\nCreate a roadmap for aligning US technical operations with the parent company's global standards without disrupting the brand's local market advantage.\nBridge communications between the UK corporate headquarters and the US-based leadership team to ensure technical alignment and cultural buy-in.\n\nDeep experience in high-volume retail, specifically in the sectors, where omnichannel and inventory velocity are critical.\nProven track record of leading IT integrations for large-scale acquisitions (ideally involving UK and US entities).\nSkilled in design and application rationalization.\nExperience advising C-suite leaders (CTOs/CIOs) through complex, urgent transformations.",
    "location": "",
    "time_posted": "18 hours",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "xp4dpg",
    "title": "Public Relations Consultant for Sustainable Infrastructure Company",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Public Relations Strategy"
    ],
    "description": "Overview:\nWe're a global leader in sustainable infrastructure that is looking for a strategic PR consultant to lead the strategic communications for a major acquisition. \n\nWe need a though partner who understands the nuances of the Digital Out-of-Home (DOOH) and Ad-Tech landscape to position our newly expanded network as the most innovated, data-driven player in North America.\n\n\nAd-Tech Specialist: Deep experience in digital advertising, DOOH, or media technology.\nMedia Access: Existing, active relationships with editors at Adweek, AdAge, The Drum, Digiday, and other tier-one trades.\nProven Results: A track record of securing earned media for brands in the advertising space within the last 12 months.\nStrategic Vision: Ability to act as a consultant—not just a publicist—to craft a \"Phase 2\" narrative that positions the brand as a data-driven innovator.",
    "location": "",
    "time_posted": "21 hours",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "xe9kem",
    "title": "Director, Digital Marketing & Integration Leader",
    "categories": [
      "Sales & Marketing",
      "Digital Marketing",
      "Digital Marketing Project Management"
    ],
    "description": "Overview:\nWe are seeking a strategic and results-driven Sr. Principal of Digital Marketing & Integration Leade to lead the integration and harmonization of our digital marketing practices across the enterprise. This role is pivotal in shaping our overall digital presence, driving customer engagement, and ensuring a seamless brand and operational integration across diverse platforms, teams, and processes.\n\nThe Digital Marketing and Integration Leader will be responsible for helping to shape the future of the digital experience for our global organization. They will be tasked with analyzing, planning, and executing on high-impact, cross-functional initiatives that will transform our primary web properties and other key digital touchpoints.\nThe ideal candidate will be someone who thrives in ambiguity and possesses the high-level expertise required to operate independently within a complex corporate environment.\n\n\nDevelop and execute a comprehensive digital marketing integration strategy aligned with business goals and customer needs.\nLead digital campaigns integration across web, email, SEO/SEM, social media, and paid media to drive awareness, engagement, and conversion.\nCollaborate with product marketing, sales, and scientific teams to ensure consistent messaging and positioning.\nManage initiative level digital marketing budget and agency/vendor relationships.\nServe as the marketing lead for the integration of two companies, ensuring alignment of digital assets, brand identity, and customer experience.\nDevelop and manage integration plans for digital platforms, including websites, CRM systems, marketing automation, and analytics tools.\nPartner with cross-functional teams (IT, HR, Sales, Legal, etc.) to ensure smooth operational and cultural integration.\nLead change management and communication strategies to support internal and external stakeholders.\nBuild and mentor a high-performing digital marketing team.\nSet clear goals, KPIs, and performance metrics for team members and campaigns.\n\nBachelor’s degree in Marketing, Communications, or related field; MBA or advanced degree preferred.\n10+ years of experience in digital marketing, with at least 5 years in a leadership role.\nProven experience in managing digital transformation or integration projects, ideally in the life sciences or healthcare industry.\nStrong understanding of digital marketing tools, platforms, and analytics.\nExcellent leadership, communication, and project management skills.\nAbility to thrive in a fast-paced, dynamic environment with multiple stakeholders.",
    "location": "Boston, MA, USA",
    "time_posted": "22 hours",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "x3wvjq",
    "title": "Sr. Consultant for Diligence in Towers and Wireless Industry",
    "categories": [
      "Market Research",
      "General Market Research",
      "General Market Research Expertise"
    ],
    "description": "**In your pitch** Please copy and paste the Ideal Candidate bullets to respond with your specific experiences, providing specific examples of previous diligence you have worked on\n\nWe are a consulting firm that is looking for a senior consultant to assist our team on a Towers and Wireless diligence projects. Prior experience with market overview, market analysis, business plan assessment, market forecasts. Strong excel and communication skills desired.\n\nThis specific project will last 4 weeks and will start as soon as possible.\n\nWhile this is one project, we typically have multiple similar diligence engagements that we are also looking for Data Center, Fiber, Towers, and general TMT experience.\n\n\nFormer Management Consultant with Diligence experience\nExperience with TMT Industry\nExperience with Towers and/or Wireless",
    "location": "",
    "time_posted": "3 minutes",
    "status": "New Project",
    "detected_at": "2026-01-06 23:37:00"
  },
  {
    "id": "xq48mb",
    "title": "Engineered wire harness data center product strategy",
    "categories": [
      "Digital Transformation & Technology",
      "Digital Strategy & Transformation",
      "Product Management"
    ],
    "description": "A custom fabricator of wire harness assemblies is looking to break into the data center market through the electrical contractor channel.  They would like to collect intelligence on the appropriate product suite (e.g., common configurations) to offer to customers and then would like technical guidance as they build an online configuration tool into their website and sales materials\n\nDomain knowledge of data center configurations and powering assemblies (e.g., Powerwhips, PDU cables) and the components that go into them is important for this role",
    "location": "",
    "time_posted": "32 seconds",
    "status": "New Project",
    "detected_at": "2026-01-07 20:30:29"
  },
  {
    "id": "rp45dg",
    "title": "Competitive War Gaming & Commercial Strategy: Global Renal Denervation (RDN) Market",
    "categories": [
      "Market Research",
      "General Market Research",
      "Competitive Analysis"
    ],
    "description": "Industry: Medical Technology / Medical Devices\n\nCorporate Strategy / Market Intelligence\n\nA leading global medical technology company is seeking a strategic consultant to facilitate a \"War Gaming\" exercise for its Renal Denervation (RDN) portfolio. While the client is currently the global market leader in this space, new market entrants and evolving clinical landscapes necessitate a proactive assessment of competitive threats in the US and key international markets.\n\nThe client currently holds a leadership position in revenue and brand perception across 80+ countries. However, the market is approaching a pivot point due to new reimbursement approvals and upcoming US entries from major competitors. Competitive pressure is specifically intensifying around technical modalities, procedure efficiency, and depth of ablation.\n\nThe client is looking for a vendor with specific experience facilitating cross-functional \"war gaming\" exercises. The goal is to:\n\n\nAssess the evolving competitive landscape across the US, Western Europe, China, and Japan.\n\nSimulate competitor movements and pressure-test current commercial strategies.\n\nAlign internal cross-functional stakeholders on a comprehensive response to market challenges.\n\n\nA PowerPoint summary capturing the outputs of the group exercises.\n\nA compiled list of actionable recommendations and commercial strategies based on the workshop findings.\n\nTimeline & Logistics\n\nTarget kickoff in February\n\nRemote with a global view preferred (US, Western Europe, China, and Japan).",
    "location": "",
    "time_posted": "3 minutes",
    "status": "New Project",
    "detected_at": "2026-01-07 22:26:50"
  },
  {
    "id": "x42mmq",
    "title": "Technology Transformation Program Manager for PE-backed SaaS company",
    "categories": [
      "Digital Transformation & Technology",
      "Technology Assessment & Implementation",
      "Technology Implementation Project Management"
    ],
    "description": "***NOTE TO CANDIDATES: As part of your pitch, please copy/paste the “Ideal Candidate” bullets and briefly reply with your relevant qualifications for each one.",
    "location": "",
    "time_posted": "35 minutes",
    "status": "New Project",
    "detected_at": "2026-01-09 18:40:35"
  },
  {
    "id": "y82pp2",
    "title": "Senior Financial Modeling Expert (Excel Research Lab - Remote)",
    "categories": [
      "Finance & Accounting",
      "Finance",
      "Financial Modeling"
    ],
    "description": "Problem Statement:\nWe are an AI for Excel research lab, currently operating in stealth mode, with a focus on enhancing the capabilities of Large Language Models (LLMs) in complex financial modeling. A pivotal aspect of our project is acquiring high-quality, professional-grade financial modeling data. While we've utilized various freelance platforms, we've found a need for a higher level of talent to maintain data input quality that matches premier institutional standards.\n\n\nThe objective is to have experts develop superior, technically robust financial models that will serve as essential data for LLM training. The project's success will be gauged by the precision and accuracy of the Excel models and the consultants' proficiency in navigating complex financial scenarios without compromising quality.\n\n\n- **Model Creation**: Develop comprehensive, professional-standard financial models within Excel.\n- **Quality Assurance**: Ensure that all models are logically coherent and \"auditor-ready\" for research objectives.\n- **Output-Based Delivery**: Begin with an hourly engagement model, with a transition towards an output/deliverable-based payment model for consistent, high-performing experts.\n\n\nWe seek individuals with exceptional qualifications, characterized by the following:\n- **Investment Banking Experience**: At least 2 years within an Investment Banking firm.\n- **Private Equity Experience**: An additional 1–2 years of experience within Private Equity.\n- **Excel Proficiency**: Must have extensive, recent experience in financial modeling and be considered an \"Excel beast.\"\n- **Alternative Backgrounds**: Open to senior experts (20+ years) who have maintained hands-on financial modeling expertise throughout their careers.\n- Note: General FP&A experience does not typically meet the specific technical modeling requirements we seek.\n\n\n- **Duration**: Immediate start, with the budget expanding to support a significant scale-up in hiring.\n- **Volume**: Anticipating onboarding 10 to 30+ individuals as the project scales.\n- **Location**: 100% Remote; our focus is on North American financial professionals, though we welcome exceptional global talent (EMEA/APAC).",
    "location": "",
    "time_posted": "38 minutes",
    "status": "New Project",
    "detected_at": "2026-01-09 18:40:35"
  },
  {
    "id": "y92kk7",
    "title": "Portfolio Reputation Monitoring & Strategy",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Public Relations Strategy"
    ],
    "description": "A large cap PE firm is seeking a consultant or small team to develop a scalable solution for internal reputation management and online monitoring across its portfolio. While the firm has PR resources, they currently lack a centralized way to monitor the portfolio at scale and identify where to focus intervention efforts. \n\n\n Establish a system to monitor online reviews, comments (e.g., Reddit, Google), and general sentiment across multiple portfolio companies simultaneously.\n Move beyond basic \"data scraping\" to provide competitive benchmarking—analyzing how portfolio companies stack up against competitors in the digital landscape.\n Identify and prioritize \"red flag\" reputational issues that could potentially \"tank a sale\" or decrease valuation during a divestiture process.\n Provide a clear framework for the firm to know exactly which portfolio companies require reputation support and when.\n\n Proven experience managing online reviews and brand sentiment at scale (not just at a single-company level).\n Ability to translate raw data into strategic insights for PE operating partners (the \"where to focus\").\n Knowledge of sentiment analysis and monitoring tools, but with a focus on high-level strategy rather than just technical development.\n\n\nWhen submitting a pitch, please include any relevant case studies in Private Equity environments.",
    "location": "",
    "time_posted": "11 minutes",
    "status": "New Project",
    "detected_at": "2026-01-09 21:33:24"
  },
  {
    "id": "y42mmn",
    "title": "Former Operator for Warehouse Operations & Embellishment Assessment",
    "categories": [
      "Operations & Supply Chain Management",
      "Operations & Process Improvement",
      "General Operations Expertise"
    ],
    "description": "***NOTE TO CANDIDATES: As part of your pitch, please copy/paste the “Ideal Candidate” bullets and briefly reply with your relevant qualifications for each one.\n\nWe're a privately held Professional Services & Distribution company, currently generating $60M in annual revenue and specializing in uniforms and promotional products. Following a leadership transition and a period of significant growth, we are looking to scale our operational infrastructure.\n\nWe have recently purchased a 100,000 sq. ft. warehouse in Ohio and are preparing for a critical move and consolidation in March. As we transition away from leased space and upgrade our Warehouse Management System (WMS), we have identified a need for a professional, third-party assessment of our current operational processes. We are currently relying heavily on internal legacy reporting and seek a \"True North\" perspective on what \"great\" looks like for a mid-market distribution and services organization of our complexity.\n\nThe primary objective of this engagement is to perform a 360-degree audit of our Ohio operations—specifically focusing on team dynamics, throughput optimization, technology utilization, and the integration of our \"embellishment\" (embroidery/customization) services—to ensure we are optimized for headcount costs and scalability.\n\n\nConduct a 3–4 day deep-dive assessment at our Ohio warehouse, interviewing the Director of Operations and auditing functional teams (Shipping, Picking, Packing, and Embellishment).\nAnalyze current workflows, throughput metrics, and reporting structures to identify bottlenecks and areas where legacy processes are failing to meet current complexity.\nEvaluate how current tools and the impending WMS upgrade are being utilized to optimize headcount and operational efficiency.\nAssess the specialized embroidery/customization function within the warehouse to ensure it is seamlessly integrated with standard receiving and fulfillment operations.\nProvide a comprehensive recap that validates current effective practices and identifies specific \"blind spots\" or areas for improvement.\nDevelop a \"True North\" proposal outlining the necessary steps for operational excellence as we move into the new facility in March/April.\nFacilitate feedback sessions with the SVP & GM, VP of Operations, and HR leadership to align on findings and organizational health.\n\nYou have a \"been there, done that\" background, specifically having managed or led warehouse operations in a mid-market distribution environment.\nProven experience with distribution organizations that include a \"services\" or \"customization\" component (e.g., embroidery, embellishments, or light manufacturing).\nUnderstanding of the tools and processes appropriate for a $50M–$200M company.\nExperience evaluating or implementing Warehouse Management Systems to drive headcount optimization and data-driven decision-making.\nAbility to quickly assess team dynamics and operational health through on-site interviews and observational analysis.\nAbility to translate complex operational findings into a clear, high-level strategic roadmap for executive leadership.",
    "location": "Columbus, OH, United States",
    "time_posted": "6 minutes",
    "status": "New Project",
    "detected_at": "2026-01-12 22:16:00"
  },
  {
    "id": "ywmjj5",
    "title": "Cybersecurity Framework Mapping & Gap Analysis (AICPA Membership Required)",
    "categories": [
      "Digital Transformation & Technology",
      "Technology Assessment & Implementation",
      "Technology Assessment"
    ],
    "description": "Project Overview\nWe are seeking a consultant with an active AICPA membership to perform a comparative analysis and control mapping across several major cybersecurity frameworks. This project requires someone who has performed cybersecurity audits in the past and can provide firsthand context on the level of effort and \"test time\" associated with various controls.\n\n\nFramework Analysis: Summarize the specific controls and processes required to achieve SOC 2, ISO 27001, FedRAMP, and PCI DSS v4.01.\nOverlap Mapping: Identify duplicative controls across these frameworks to determine where work in one area satisfies requirements in another.\nData Access: Utilize AICPA membership to access specific mapping tools and datasets currently behind paywalls that the client cannot access internally.\nOperational Context: Beyond a paper mapping, provide insights into the practical \"audit\" experience—specifically how long these tests typically take to perform and how cybersecurity stacks are reviewed in practice.\n\nCredentials: Active AICPA member (required) with prior experience certifying clients or performing audits against the listed frameworks.\nTechnical Knowledge: Strong understanding of cybersecurity stacks and control environments.\nLevel of Effort: This is estimated to be a quick-turnaround engagement (2–3 days of work) and is suitable for a junior-to-mid-level associate, provided they have the necessary membership and audit experience.\n\nTiming: ASAP start with a 2–3 day turnaround.",
    "location": "$10,000",
    "time_posted": "8 minutes",
    "status": "New Project",
    "detected_at": "2026-01-13 16:39:11"
  },
  {
    "id": "xg6n39",
    "title": "Voice of Customer (VOC) Process Review & Strategy",
    "categories": [
      "Market Research",
      "General Market Research",
      "Market Research Project Management"
    ],
    "description": "Overview:\nA global electronics manufacturer is looking for a consultant to review and enhance its Voice of Customer (VOC) processes as the company undergoes a major transition and integration. The goal is to ensure robust, scalable methods for gathering, analyzing, and acting on customer feedback across products, processes, and services.\nHistorically, VOC efforts included an annual Net Promoter Score (NPS) survey, a targeted customer service survey (administered by a third party and focused on purchasing teams), and a real-time “happy faces” feedback tool. While current indicators show high satisfaction levels, engagement is limited to a small subset of customers, creating a need for more comprehensive, representative input.\nWe'd like a holistic view/approach for this project, so we envision dividing it into 2 phases:\n Assess the current VOC state, identify gaps, share best practices, and develop a future-state strategy and implementation plan.\n Support the execution of the recommended approach, ensuring processes are effective and scalable globally.\n\n\nIndustrial/B2B experience, ideally in the electronics or materials industry.\nStrong understanding of industry standards and best practices when it comes to NPS, customer service, VOC surveys, etc.\nProven experience designing and implementing VOC programs globally.\nBased in North America, some travel to the Philadelphia are may be required.\n\n\nRelevant experience in VOC process design, implementation, and optimization.\nExperience within the electronics or electronic manufacturing sector.\nGlobal experience.",
    "location": "",
    "time_posted": "10 minutes",
    "status": "New Project",
    "detected_at": "2026-01-13 21:53:00"
  },
  {
    "id": "rm4jzv",
    "title": "PMO Diagnostic & Standardization/Training",
    "categories": [
      "Operations & Supply Chain Management",
      "Operations & Process Improvement",
      "Operations Project Management"
    ],
    "description": "We are a PE-backed Industrial Automation and Systems Integration company that provides full-stack automation capabilities—from the physical layer (robotics, vision, and electrical installation) through PLC controls, SCADA, and MES—serving customers across Life Sciences, Food & Beverage, CPG, Chemicals, and other discrete and process industries.\n\nWe have been growing rapidly through add-on acquisitions. In the last year we've acquired 4 new businesses that are now operating as BU under our corporate platform. \n\nIn each of these BUs there is a variance of project management maturity and capabilities, and we're now at the size and growth rate that we would like to formalize a PMO and bring the various PMs across these BU to a level of standardization and competency. \n\nWe're looking for a consultant that has had extensive experience setting up and managing PMOs in a project-based industry. Because our companies are working on complex project, there's an added layer of complexity to setting up and establishing best practices for the function. \n\nKey Responsibilities/Goals of the Engagement: Current state maturity diagnostic (by BU and at platform level) across people, process, systems.\nStandardized project language, key definitions, and core lifecycle (opportunity → URS /estimate → proposal / contract → hand‑off → execution → change control → EAC / financials → close‑out / lessons learned).\nRecommended future-state roles/org, processes, and tool stack (incl. what is BU-specific vs. shared vs. platform-level).\nPhased implementation roadmap and resource plan.",
    "location": "Chicago, IL, USA",
    "time_posted": "13 minutes",
    "status": "New Project",
    "detected_at": "2026-01-13 22:31:25"
  },
  {
    "id": "xvmwb6",
    "title": "Patient Engagement Platform Advisory Support",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Go-to-Market Strategy"
    ],
    "description": "Our client is a leading patient engagement platform that facilitates high-volume online bookings, virtual visits, and digital patient check-ins. As they enter a new phase of growth, they are seeking a Senior Advisor to support the leadership team in evolving their commercial model, and launching a new product line. \n\nThis is a (3-month minimum) intended for a subject matter expert who has successfully navigated the transition from a specialized healthcare tool to a broader, diversified marketplace or platform. The advisor will serve as a strategic partner to leadership, ensuring that the new product and commercial direction are grounded in proven industry playbooks.\n\n\nThe ideal candidate is a specialist with firsthand experience at a high-growth healthcare marketplace during a pivotal shift in their business model.\n\n\nExperience Bonus: Strong preference for candidates who were present during Zocdoc's specific period of commercial model evolution (e.g., the shift to sponsored listings or paid discovery). \nFunctional Expertise: A proven track record in GTM, Operations, Commercial Strategy, or Sales Leadership.\nStrategic Advisory: The ability to offer \"been-there-done-that\" insights into the operational challenges of scaling a healthcare-specific marketplace product.\n\n3-month minimum commitment.\nSemi-permanent advisory role.\nScope, time commitment, and specific deliverables will be defined based on the consultant’s unique skillset and seniority.",
    "location": "$10,000",
    "time_posted": "49 minutes",
    "status": "New Project",
    "detected_at": "2026-01-14 03:07:24"
  },
  {
    "id": "r5288j",
    "title": "Pricing Strategy for PE-Backed Aerospace Company",
    "categories": [
      "Market Research",
      "General Market Research",
      "Pricing Analysis & Optimization"
    ],
    "description": "We are a PE firm with a portfolio company in the aerospace industry. This company sells and operationalizes engine upgrades, but also does upgrades, maintenance, and repairs for turbo prop single and multi engine planes. We are looking for a consultant to help us understand the pricing strategy around the alternatives on these engine upgrades and refurbishments, ultimately helping us improve our margins. \n\nThis consultant would have direct experience working with pricing strategy in the Aerospace industry, whether that was working at a firm or as a pricing operator at a large Aerospace company (United Technologies, Honeywell, etc.). They will need domain expertise related to engines and engine components. \n\nThis project will be a 4-6 week diagnostic with the potential to extend beyond to support the implementation phase. We are looking to kick off the project as soon as we identify the right consultant.",
    "location": "",
    "time_posted": "29 minutes",
    "status": "New Project",
    "detected_at": "2026-01-14 18:53:55"
  },
  {
    "id": "yp45kn",
    "title": "Operating Model & Margin Optimization (B2B Tech-Enabled Services)",
    "categories": [
      "Operations & Supply Chain Management",
      "Operations & Process Improvement",
      "General Operations Expertise"
    ],
    "description": "We are a PE firm that invests into lower-middle-market B2B SaaS companies. Our portfolio company provides learning and compliance management software for accounting firms. The L&D segment of the business operates on a \"subscription access to expertise\" model, where their large enterprise clients receive high-end expertise and staff augmentation and “L&D in a box” solution for smaller firms. The current operating model is immature, so the goal is to stabilize a disciplined operating model that optimizes internal capacity and maximizes gross margin as the business scales.\n\nThe consultant will conduct a deep-dive diagnostic of the internal workings of the service delivery model. This is not a vendor spend rationalization or a pure pricing exercise; rather, it is an operational assessment focused on how the team delivers value to increase gross margins.\n\nWe are looking to kick this work off as soon as possible with a critical checkpoint in mid-to-late February/March. The final, detailed roadmap and implementation plan are expected by the April/May timeframe.\n\n\nAnalyzing current state gross margin by customer and identifying specific levers for improvement.\nEvaluating team utilization and identifying opportunities to leverage lower-cost resources for specific activities.\nRefining the organizational structure and standardized operating rhythms to support an expertise augmentation managed services model.\n: Delivering a detailed plan to capture margin points through better resource leveling and process efficiency.\n\n\nFormer COO, VP of Ops, or CFO for Services Businesses\nExperience with Organizational Design \nCost Optimization through internal process design, resource allocation, and organizational scaling",
    "location": "",
    "time_posted": "15 minutes",
    "status": "New Project",
    "detected_at": "2026-01-14 21:19:18"
  },
  {
    "id": "ym4j5v",
    "title": "Brand Licensing Consultant (NFL)",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Brand Strategy"
    ],
    "description": "We are a PE-backed consumer goods business that recently had a very successful year after gaining licensing rights for NCAA teams on our products. Based on this success, we're hoping to break into the NFL brand licensing space as well. \n\nWe're looking for someone that has experience and can help our team get the right approvals and negotiate with the NFL brand licensing.",
    "location": "",
    "time_posted": "3 minutes",
    "status": "New Project",
    "detected_at": "2026-01-14 22:00:16"
  }
]